/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   count_alpha.c                                      :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: yijhuang <yijhuang@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/09/13 19:08:16 by yijhuang          #+#    #+#             */
/*   Updated: 2019/09/13 19:14:26 by yijhuang         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <stdio.h>

/*
1）建立26个字母的数组，所有数字都从0开始
2）遇到字母就在对应的数组位置上+1
3）从str开头开始遇到字母不是0的就显示，显示完之后置零。直到字符串结束。
 */

void count(char *str)
{
    
}

int main(int ac, char **av)
{
    if (ac == 2)
        count(av[1]);
    printf("\n");
}